Repository: YasserYaid/BuscaminasCliente2
Catalog: Cliente/Properties/Langs/Lang.*.resx
Languages: es_mx

# Aceptar_EG
source: Accept
es_mx: Aceptar

# Agregar_EG
source: Add
es_mx: Agregar

# AlertaCamposVacios_MSJ
source: There are empty fields
es_mx: Hay campos vacios

# AlertaCodigoSalaNoIntroducido_MSJ
source: The room code cannot be left empty, please enter a room code.
es_mx: El codigo de la sala no puede quedar vacio, por favor introduzca un codigo de sala.

# AlertaCorreoEsRequerido_MSJ
source: The email cannot be empty, it is necessary to enter a valid email address.
es_mx: El correo no puede quedar vacio, es necesario introducir un correo valido

# AlertaFilaDeAmigoNoSeleccionada_MSJ
source: Do not select any player, select a player first
es_mx: No selecciono nungun jugador, seleccione un jugador primero

# AlertaFilaDeSolicitudNoSeleccionada_MSJ
source: I did not select any friend request, select a request first
es_mx: No selecciono nunguna solicitud, seleccione una solicitud primero

# AlertaFormatoContraseniaNoValido_MSJ
source: Invalid password, enter a password of at least 6 characters with a combination of at least one letter, one number, and one special character.
es_mx: Contraseña no valida, introduzca una contraseña de minimo 6 caracteres con una combinacion de al menos una letra, un numero, y un caracter especial

# AlertaJugadorBaneado_MSJ
source: This account is banned
es_mx: Esta cuenta esta baneada

# AlertaLaCuentaYaExiste_MSJ
source: An account already exists with the information entered.
es_mx: Ya existe una cuenta con la informacion introducida

# AlertaMismoNombreUsuarioDestino_MSJ
source: The username cannot be the same as your account name.
es_mx: El nombre de usuario no puede ser el mismo que el de la cuenta de usted.

# AlertaNoExisteNombreUsuario_MSJ
source: The user name you are looking for does not exist in the system registry.
es_mx: El nombre de usuario buscado no existe en el registro del sistema.

# AlertaNoExisteSala_MSJ
source: There is none for the code entered, check the code and try again.
es_mx: No existe ninguna para el codigo ingresado, verifique el codigo e intente de nuevo.

# AlertaNoHayDosJugadores_MSJ
source: There must be exactly two players, otherwise the game cannot start.
es_mx: Es necesario que haya exactamente dos jugadores, sino no se puede empezar el juego.

# AlertaNoSeIngresoNombreUsuario_MSJ
source: I did not enter a user name in the search engine, please enter one to proceed.
es_mx: No ingreso un nombre de usuario en el buscador, ingrese uno para poder proceder

# AlertaNoSePudoAgregarAmistad_MSJ
source: A failure occurred and the selected player could not be added to your friends list, try again at another time.
es_mx: Ocurrio un fallo y no se pudo agregar al jugador seleccionado a su lista de amigos, intentelo de nuevo en otro momento

# AlertaNoSePudoBorrarAmistad_MSJ
source: A failure occurred and the selected player could not be deleted from your friends list, try again at another time.
es_mx: Ocurrio un fallo y no se pudo borrar al jugador seleccionado de su lista de amigos, intentelo de nuevo en otro momento

# AlertaNoSePudoBorrarSolicitud_MSJ
source: A failure occurred and the selected friend request could not be deleted from your list of requests, please try again at a later time.
es_mx: Ocurrio un fallo y no se pudo borrar la solicitud seleccionada de su lista de solicitudes, intentelo de nuevo en otro momento

# AlertaNoSePudoEnviarSolicitud_MSJ
source: A failure occurred and the request could not be sent, please try again later.
es_mx: Ocurrio un fallo y no se pudo enviar la solicitud, intente en otro momento

# AlertaSalaLlena_MSJ
source: At the moment the game only supports two users per room and it is already full.
es_mx: De momento el juego solo admite dos usuarios por sala y ya esta llena

# AlertaYaExisteUnaSolicitudEnviada_MSJ
source: A request has already been sent, it cannot be resubmitted.
es_mx: Ya existe una solicitud enviada, no se puede volver a enviar

# Amigos_EG
source: Friends
es_mx: Amigos

# Atras_EG
source: Back
es_mx: Atras

# AvisoAmigoBaneado_MSJ
source: Friend Friend in ban status
es_mx: Amigo en estado de baneo

# AvisoAmigoNormal_MSJ
source: Friend in normal state
es_mx: Amigo en estado normal

# AvisoAmistadAgregada_MSJ
source: Has been added to friends list
es_mx: Se ha agregado a la lista de amigos

# AvisoAmistadBorrada_MSJ
source: The selected player has been deleted from your friends list.
es_mx: El jugador seleccionado ha sido borrado de su lista de amigos

# AvisoBienvenido_MSJ
source: Welcome
es_mx: Bienvenido

# AvisoConfirmarCancelacionJuego_MSJ
source: The room code will be lost, and a new one will be generated. This action cannot be undone, are you sure you want to cancel the game?
es_mx: El codigo de la sala se perdera, y se generara uno nuevo esta accion no se puede deshacer, ¿Esta seguro de que desea cancelar el juego?

# AvisoConfirmarEliminacionSolicitud_MSJ
source: Are you sure you want to remove this request from your request list?
es_mx: ¿Esta seguro que desea eliminar esta solicitud de su lista de solicitudes?

# AvisoConfirmarEliminacion_MSJ
source: Are you sure you want to remove this player from your friends list?
es_mx: ¿Esta seguro que desea eliminar este jugador de su lista de amigos?

# AvisoCuentaRegistradaExitosamente_MSJ
source: Account successfully registered in the system.
es_mx: La cuenta se registro con exito en el sistema

# AvisoFormularioLlenadoMal_MSJ
source: The form was filled out incorrectly please check it.
es_mx: El formulario se lleno incorrectamente o no se lleno por favor reviselo

# AvisoIdiomaCambiado_MSJ
source: The application language has changed, please press back to reload.
es_mx: El idioma de la aplicacion cambio, por favor presione atras para recargar

# AvisoSalida_MSJ
source: Exiting the game, thank you for playing minesweeper.
es_mx: Saliendo del juego, gracias por jugar al buscaminas

# AvisoSolicitudAmistadBorrada_MSJ
source: The selected friend request has been deleted from your list of requests.
es_mx: La solicitud seleccionada ha sido borrada de su lista de solicitudes

# AvisoSolicitudEnviada_MSJ
source: The request to the searched user has been sent successfully.
es_mx: La solicitud al usuario buscado se envio satisfactoriamente

# Banderas_EG
source: Flags :
es_mx: Banderas :

# Buscaminas_EG
source: MineSweeper
es_mx: Buscaminas

# CambiarApariencia_EG
source: Change appearance
es_mx: Cambiar Apariencia

# CancelarJuego_EG
source: Cancel Game
es_mx: Cancelar Juego

# Cancelar_EG
source: Cancel
es_mx: Cancelar

# Cerrar_EG
source: Close
es_mx: Cerrar

# CodigoConfirmacion_EG
source: Confirmation code
es_mx: Codigo de confirmacion

# CodigoSala_EG
source: Lobby Code
es_mx: Codigo de la sala

# ConfirmarContrasenia_EG
source: Confirm Password
es_mx: Confirmar Contraseña

# Contendiente_EG
source: Contenders
es_mx: Contendientes

# Contrasenia_EG
source: Password
es_mx: Contraseña

# CorreoAsuntoCodigoInvitacion_MSJ
source: Minesweeper game invitation code
es_mx: Codigo de invitación al juego del buscaminas

# CorreoAsuntoCodigoRegistroCuenta_MSJ
source: Minesweeper Game Registration Code
es_mx: Codigo de registro del juego de Buscaminas

# CorreoMensajeCodigoInvitacion_MSJ
source: has invited you to play minesweeper. Enter the following room code:
es_mx: lo ha invitado a jugar al buscaminas. Ingrese el siguiente código de sala:

# CorreoMensajeCodigoRegistroCuenta_MSJ
source: Your minesweeper registration code is :
es_mx: Su codigo de registro del buscaminas es :

# Correo_EG
source: Email
es_mx: Correo

# CrearSala_EG
source: Create Lobby
es_mx: Create Sala

# Creditos_EG
source: Credits
es_mx: Creditos

# DosJugadores_EG
source: Two Players
es_mx: Dos Jugadores

# Eliminar_EG
source: Delete
es_mx: Eliminar

# Empate_EG
source: Draw
es_mx: Empate

# EnviarCodigo_EG
source: Send confirmation code
es_mx: Enviar codigo de confirmacion

# EnviarMensaje_EG
source: Send message
es_mx: Enviar Mensaje

# EnviarSolicitud_EG
source: Send friend request
es_mx: Enviar solicitud de amistad

# ErrorBMExcepcionNombreIncorrectoBoton_MSJ
source: Incorrect button name in JuegoGUI.xaml
es_mx: Error nombre incorrecto para el boton en el xaml de JuegoGUI

# ErrorBMExcepcionReferenciaInvalidaBoton_MSJ
source: Invalid button reference when revealing the cell in the table (the button points to an invalid cell).
es_mx: Referencia inválida del Boton al revelar la celda en el tablero (el botón apunta a una celda no válida)

# ErrorCamposConCaracterEspacio_MSJ
source: The fields cannot be filled with the space character only, as they will be blank.
es_mx: Los campos no pueden llenarse solo con el caracter de espacio, ya que quedarian en blanco

# ErrorCodigosConfirmacionDiferentes_MSJ
source: The confirmation code sent to the email does not match the confirmation code entered.
es_mx: El codigo de confirmacion enviado al correo no coincide con el codigo de confirmacion introducido

# ErrorContraseniaNoCoincide_MSJ
source: Passwords do not match
es_mx: Las contraseñas no coinciden

# ErrorCuentaNoRegistrada_MSJ
source: The account could not be registered, please try again at a later time.
es_mx: No se pudo registrar la cuenta, intente de nuevo en un otro momento

# ErrorDatosIncorrectos_MSJ
source: Username or password are not correct
es_mx: El nombre de usuario o contraseña no son los correctos

# ErrorFormatoCorreoInvalido_MSJ
source: The email format is not valid
es_mx: El formato del correo no es valido

# ErrorIngresandoASala_MSJ
source: There was a failure and could not enter the room, try again at a later time.
es_mx: Ocurrio un fallo y no se pudo ingresar a la sala, intente en otro momento

# ErrorNoSeEncontroServidor_MSJ
source: Cannot find server
es_mx: No se puede encontrar el servidor, el programa se cerrara.

# ErrorNoSePudoBorrarJugadorSala_MSJ
source: A failure occurred and the player could not be deleted from the room, try again at another time.
es_mx: Ocurrio un fallo y no se pudo borrar al jugador de la sala, intentelo de nuevo en otro momento

# ErrorNosePudoCrearLaSala_MSJ
source: There was a failure and the room could not be created.
es_mx: Hubo un fallo y no se pudo crear la sala

# ErrorObjetoComunicacionConServidor_MSJ
source: There is an error with the communication object of the server.
es_mx: Hay un error con el objeto de comunicacion del servidor, el programa se cerrara

# Espaniol_EG
source: Spanish
es_mx: Español

# EsperandoJugador_EG
source: Waiting Player
es_mx: Esperando jugador

# Estado_EG
source: Status
es_mx: Estado

# Femenino_EG
source: Female
es_mx: Femenino

# Ganador_EG
source: Winner
es_mx: Ganador

# Genero_EG
source: Gener
es_mx: Genero

# Ingles_EG
source: English
es_mx: Ingles

# IngresarCodigoSala_EG
source: Enter the room code
es_mx: Ingresar el codigo de la sala

# IngresarNombreUsuario_EG
source: Enter user name
es_mx: Ingresar nombre de usuario

# IniciarJuego_EG
source: Start Game
es_mx: Iniciar Juego

# IniciarSesion_EG
source: Login
es_mx: Iniciar Sesion

# Invitar_EG
source: Invite
es_mx: Invitar a jugar

# Jugador1DebeComenzar_MSJ
source: The first player must start the game
es_mx: El primer Jugador debe comenzar el juego

# Jugador1_EG
source: Number one player
es_mx: Jugador numero uno

# Jugador2_EG
source: Number two player
es_mx: Jugador numero dos

# JugadoresSala_EG
source: Players in the Lobby
es_mx: Jugadores en la sala

# Jugador_EG
source: Player
es_mx: Jugador

# Jugar_EG
source: Play
es_mx: Jugar

# ListaDeAmigos_EG
source: Friendlist
es_mx: Lista de amigos

# ListarAmigos_EG
source: List Friend
es_mx: Listar Amigos

# ListarSolicitudesAmistad_EG
source: List friend requests
es_mx: Listar solicitudes de amistad

# Masculino_EG
source: Male
es_mx: Masculino

# MenuPrincipal_EG
source: Main Menu
es_mx: Menu Principal

# Minas_EG
source: Mines
es_mx: Minas

# NombreUsuario_EG
source: UserName
es_mx: Nombre de Usuario

# NoSeEncontroSala_MSJ
source: There is no room corresponding to the code entered.
es_mx: No se encontro ninguna sala existente para el codigo introducido

# Opciones_EG
source: Options
es_mx: Opciones

# Oponente_EG
source: Rival
es_mx: Oponente

# PreguntaEresUsuario_EG
source: Not registered in the game yet?
es_mx: ¿Aun no te has registrado en el juego?

# RegistrarCuenta_EG
source: Register account
es_mx: Registrar Cuenta

# Registrarse_EG
source: Register
es_mx: Registrarse

# ReportarUsuario_EG
source: Report user
es_mx: ReportarUsuario

# Salir_EG
source: Exit
es_mx: Salir

# SeleccionarIdioma_EG
source: Select Language
es_mx: Seleccionar Idioma

# SolicitudesAmistad_EG
source: Friendship requests
es_mx: Solicitudes de amistad

# Tiempo_EG
source: Time :
es_mx: Tiempo :

# TituloVentanaCancelacionJuego_MSJ
source: Confirm game cancellation
es_mx: Confirmar cancelacion del juego

# TituloVentanaConfirmarEliminacionSolicitud_MSJ
source: Confirm Deletion Request
es_mx: Confirmar Eliminacion Solicitud

# TituloVentanaConfirmarEliminacion_MSJ
source: Confirm deletion
es_mx: Confirmar Eliminacion Amistad

# TuRival_EG
source: your rival
es_mx: Tu Rival

# Turno_EG
source: Turn
es_mx: Turno

# TuUsuario_EG
source: Your user
es_mx: Tu Usuario

# UnirseAlJuego_EG
source: Join the game
es_mx: Unirse al juego

# UnJugador_EG
source: Sigle Player
es_mx: Un Jugador

# Usuario_EG
source: User
es_mx: Usuario
